/**
 * Інтерфейс для авторизованого запиту
 * Розширює стандартний інтерфейс Request, додаючи інформацію про користувача
 * Використовується в контролерах для доступу до даних автентифікованого користувача
 */
export interface IAuthorizedRequest extends Request {
  /**
   * Дані користувача, який зробив запит
   * Додаються до об'єкту запиту під час автентифікації
   */
  user: {
    id: number;      // Ідентифікатор користувача
    email: string;   // Електронна пошта користувача
    role: string;    // Роль користувача в системі
  };
}
